#+title: Data Plan

#+property: header-args:jupyter-python :kernel verification-games :session /jpy:localhost#8888:vg-data-plan :async yes :exports both

#+begin_src elisp
(setq-local org-image-actual-width '(900))
(setq jupyter-repl-maximum-output 5000)
#+end_src

#+RESULTS:
: 5000

#+begin_src jupyter-python
%load_ext autoreload
%autoreload 2
#+end_src

#+RESULTS:

#+begin_src jupyter-python
from pathlib import Path
from pprint import pprint
#+end_src

#+RESULTS:

#+begin_src jupyter-python
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import xarray as xr
#+end_src

* Catalog and openghg set-up

#+begin_src jupyter-python
from ogcat import Catalog

vg_path = Path("/group/chem/acrg/verification_games_round_2")
catalog_path = vg_path / "games_catalog"

games_cat = Catalog.open(catalog_path)
#+end_src

#+RESULTS:

#+begin_src jupyter-python
from openghg.retrieve import search_footprints, get_footprint
#+end_src

#+RESULTS:

* Footprints

I previously check what object stores have footprint data, and all of the sites we need are in =shared_store_zarr=.

** Site list

These are the sites that 1) UOB has, 2) WUR is using:

#+begin_src jupyter-python
site_list = ["BIR", "BSD", "CBW", "CMN", "GAT", "HEI", "HEL", "HFD", "HPB", "HTM", "HUN", "JFJ", "KIT",
                 "KRE", "LIN", "LUT", "MHD", "NOR", "OPE", "OXK", "PAL", "PUY", "RGL", "SAC", "SSL", "STE",
                 "TAC", "TOH", "TRN", "UTO", "WAO", "WES"]
print(len(site_list))
#+end_src

#+RESULTS:
: 32

#+begin_src jupyter-python
co2_fp_res = search_footprints(species="co2", domain="europe", store="shared_store_zarr")

print(co2_fp_res.results.columns)
print("# sites:", len(co2_fp_res.results.site.unique()))
print(co2_fp_res.results.site.unique())
#+end_src

#+RESULTS:
: Index(['data_type', 'site', 'domain', 'model', 'inlet', 'height', 'species',
:        'met_model', 'start_date', 'end_date', 'time_period', 'max_longitude',
:        'min_longitude', 'max_latitude', 'min_latitude', 'time_resolved',
:        'high_spatial_resolution', 'short_lifetime', 'heights', 'variables',
:        'uuid', 'latest_version', 'timestamp', 'versions', 'object_store'],
:       dtype='object')
: # sites: 31
: ['bsd' 'hfd' 'rgl' 'tac' 'cmn' 'jfj' 'mhd' 'bir' 'cbw' 'gat' 'hei' 'hel'
:  'hpb' 'htm' 'hun' 'kit' 'kre' 'lin' 'lut' 'nor' 'ope' 'oxk' 'pal' 'sac'
:  'ssl' 'ste' 'toh' 'uto' 'wao' 'wes' 'trn']

#+begin_src jupyter-python
combined_site_list = set(site_list).union(set([s.upper() for s in co2_fp_res.results.site.unique()]))
in_store = [s.lower() in co2_fp_res.results.site.unique() for s in combined_site_list]
in_list =  [s in site_list for s in combined_site_list]

site_df = pd.DataFrame({"in_store": in_store, "in_list": in_list}, index=list(combined_site_list))
print(site_df.sort_index())
#+end_src

#+RESULTS:
#+begin_example
     in_store  in_list
BIR      True     True
BSD      True     True
CBW      True     True
CMN      True     True
GAT      True     True
HEI      True     True
HEL      True     True
HFD      True     True
HPB      True     True
HTM      True     True
HUN      True     True
JFJ      True     True
KIT      True     True
KRE      True     True
LIN      True     True
LUT      True     True
MHD      True     True
NOR      True     True
OPE      True     True
OXK      True     True
PAL      True     True
PUY     False     True
RGL      True     True
SAC      True     True
SSL      True     True
STE      True     True
TAC      True     True
TOH      True     True
TRN      True     True
UTO      True     True
WAO      True     True
WES      True     True
#+end_example

Hmm so there are multiple entries for a site. But this might be due to a change in inlet height.

#+begin_src jupyter-python
print(co2_fp_res.results[["site", "inlet"]].groupby("site").count())
#+end_src

#+RESULTS:
#+begin_example
      inlet
site
bir       1
bsd       2
cbw       1
cmn       1
gat       1
hei       1
hel       1
hfd       1
hpb       1
htm       1
hun       1
jfj       1
kit       1
kre       1
lin       1
lut       1
mhd       1
nor       1
ope       1
oxk       1
pal       1
rgl       1
sac       1
ssl       1
ste       1
tac       1
toh       1
trn       1
uto       1
wao       1
wes       1
#+end_example

Right, BSD changed from 248m to 250m at some point...

PUY is available on JASMIN, but I need to download and process it.

** Closer look at MHD

#+begin_src jupyter-python
mhd_fp = get_footprint(site="mhd", domain="europe", store="shared_store_zarr", species="co2", start_date="2021-01-01", end_date="2021-02-01")
#+end_src

#+RESULTS:

#+begin_src jupyter-python
print(mhd_fp.data)
#+end_src

#+RESULTS:
#+begin_example
<xarray.Dataset> Size: 9GB
Dimensions:                              (time: 720, lat: 293, lon: 391,
                                          H_back: 25, height: 20)
Coordinates:
  ,* H_back                               (H_back) float32 100B 0.0 1.0 ... 24.0
  ,* height                               (height) float32 80B 500.0 ... 1.95e+04
  ,* lat                                  (lat) float32 1kB 10.73 10.96 ... 79.06
  ,* lon                                  (lon) float32 2kB -97.9 ... 39.38
  ,* time                                 (time) datetime64[ns] 6kB 2021-01-02...
Data variables: (12/17)
    air_pressure                         (time) float32 3kB dask.array<chunksize=(24,), meta=np.ndarray>
    air_temperature                      (time) float32 3kB dask.array<chunksize=(24,), meta=np.ndarray>
    atmosphere_boundary_layer_thickness  (time) float32 3kB dask.array<chunksize=(24,), meta=np.ndarray>
    fp                                   (time, lat, lon) float32 330MB dask.array<chunksize=(24, 293, 391), meta=np.ndarray>
    fp_HiTRes                            (time, lat, lon, H_back) float32 8GB dask.array<chunksize=(24, 293, 391, 25), meta=np.ndarray>
    mean_age_particles_e                 (time, height, lat) float32 17MB dask.array<chunksize=(24, 20, 293), meta=np.ndarray>
    ...                                   ...
    particle_locations_s                 (time, height, lon) float32 23MB dask.array<chunksize=(24, 20, 391), meta=np.ndarray>
    particle_locations_w                 (time, height, lat) float32 17MB dask.array<chunksize=(24, 20, 293), meta=np.ndarray>
    release_lat                          (time) float32 3kB dask.array<chunksize=(24,), meta=np.ndarray>
    release_lon                          (time) float32 3kB dask.array<chunksize=(24,), meta=np.ndarray>
    wind_from_direction                  (time) float32 3kB dask.array<chunksize=(24,), meta=np.ndarray>
    wind_speed                           (time) float32 3kB dask.array<chunksize=(24,), meta=np.ndarray>
Attributes: (12/22)
    author:                   OpenGHG Cloud
    data_type:                footprints
    domain:                   europe
    end_date:                 2021-12-31 23:59:59+00:00
    height:                   10m
    heights:                  [500.0, 1500.0, 2500.0, 3500.0, 4500.0, 5500.0,...
    ...                       ...
    site:                     mhd
    species:                  co2
    start_date:               2021-12-01 00:00:00+00:00
    time_period:              1 hour
    time_resolved:            True
    variables:                ['fp', 'fp_HiTRes', 'air_temperature', 'air_pre...
#+end_example

This is the older style where =H_back= has size 25, and the value at index 24 is the "integrated remainder footprint".

** TODO get PUY footprints

* Fluxes

** DONE Fix fluxes in games catalog

These have the wrong record type; I need to fix that.
#+begin_src jupyter-python
flux_res = games_cat.search(where={"record_type": "verification_games_obs"}, as_record_set=True)

print(flux_res.to_dataframe(["id", "species", "games_scenario"]))
#+end_src

#+RESULTS:
#+begin_example
    id species games_scenario
0   77      o2           BASE
1   78      o2           ATEN
2   79      o2           DFIN
3   80      o2           HFRA
4   81      o2           HGER
5   82      o2           PTEN
6   83     co2           ATEN
7   84     co2           BASE
8   85     co2           DFIN
9   86     co2           HFRA
10  87     co2           HGER
11  88     co2           PTEN
#+end_example

#+begin_src jupyter-python
pprint(games_cat.get("77"))
#+end_src

#+RESULTS:
#+begin_example
CatalogRecord(catalog='games-catalog',
              time_added='2026-05-07T20:00:50Z',
              id='77',
              record_type='verification_games_obs',
              locator=ArtifactLocator(kind='path',
                                      value='/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_obs/UOB/CTE-HR_filled_o2_fluxes_none_EUROPE_BASE_o2_concentrations_202012-202112.nc',
                                      relative_path='data/verification_games_obs/UOB/CTE-HR_filled_o2_fluxes_none_EUROPE_BASE_o2_concentrations_202012-202112.nc'),
              stored_abspath='/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_obs/UOB/CTE-HR_filled_o2_fluxes_none_EUROPE_BASE_o2_concentrations_202012-202112.nc',
              stored_relpath='data/verification_games_obs/UOB/CTE-HR_filled_o2_fluxes_none_EUROPE_BASE_o2_concentrations_202012-202112.nc',
              storage_mode='write',
              original_path=None,
              original_filename=None,
              suffixes=[],
              user_metadata={'domain': 'EUROPE',
                             'flux_product': 'CTE-HR_filled_o2_fluxes',
                             'footprint_model': 'none',
                             'games_scenario': 'BASE',
                             'inputs': ['49', '36', '40', '41', '45'],
                             'species': 'o2',
                             'university_abbr': 'UOB',
                             'year': '202012-202112'},
              derived_metadata={'chunks': {'lat': 293, 'lon': 391, 'time': 24},
                                'domain': 'EUROPE',
                                'dtype': 'float32',
                                'fallback_sources': {'FF': 'gridfed_total_o2',
                                                     'GPP': 'sib4_o2_gpp',
                                                     'TER': 'sib4_o2_ter',
                                                     'ocean': 'cesm_scaled_o2_ocean'},
                                'input_record_ids': ['49',
                                                     '36',
                                                     '40',
                                                     '41',
                                                     '45'],
                                'output_variables': ['GPP',
                                                     'TER',
                                                     'FF',
                                                     'ocean'],
                                'reader_hint': 'xarray.open_dataset',
                                'scenario': 'BASE',
                                'sizes': {'lat': 293, 'lon': 391, 'time': 9048},
                                'source_paths': {'FF': '/group/chem/acrg/verification_games_round_2/games_catalog/data/flux/derived/GridFED/v2024.0/o2_TOTAL_EUROPE_fossil-ff-monthly_2020-2021.nc',
                                                 'GPP': '/group/chem/acrg/verification_games_round_2/games_catalog/data/flux/derived/sib4/o2_GPP_EUROPE_biosphere-fallback-gpp_202012-202112.nc',
                                                 'TER': '/group/chem/acrg/verification_games_round_2/games_catalog/data/flux/derived/sib4/o2_TER_EUROPE_biosphere-fallback-ter_202012-202112.nc',
                                                 'ocean': '/group/chem/acrg/verification_games_round_2/games_catalog/data/flux/derived/cesm_scaled_o2/o2_ocean_EUROPE_cesm-apo-regridded_20201201-20211231.nc',
                                                 'primary_o2': '/group/chem/acrg/verification_games_round_2/verification-games-fluxes/data/raw/PARIS_BASE_O2.nc'},
                                'units': 'mol m-2 s-1'},
              naming_metadata={'resolved_directory': 'verification_games_obs/UOB',
                               'resolved_filename': 'CTE-HR_filled_o2_fluxes_none_EUROPE_BASE_o2_concentrations_202012-202112.nc',
                               'storage_relative_path': 'verification_games_obs/UOB/CTE-HR_filled_o2_fluxes_none_EUROPE_BASE_o2_concentrations_202012-202112.nc'})
#+end_example


*** DONE Make a new record schema for =verification_games_flux=

#+begin_src jupyter-python
from ogcat import ArtifactLocator, CatalogSpec, CatalogRecord, MetadataFieldDescription, RecordSchema

auke_flux_file_template = "PARIS_{games_scenario}_{species}.nc"

games_data_schema = RecordSchema(
    description="Scenario fluxes for PARIS verification games.",
    directory_template="verification_games_flux/{university_abbr|}",
    filename_template=auke_flux_file_template,
    metadata_fields=[
        MetadataFieldDescription(name="title", description="Short description of data."),
        MetadataFieldDescription(name="species", description="Gas species ."),
        MetadataFieldDescription(name="domain", description="Spatial domain."),
        MetadataFieldDescription(name="games_scenario", description="Scenario for PARIS verification games."),
        MetadataFieldDescription(name="inputs", description="Description of input data."),
        MetadataFieldDescription(name="university_abbr", description="Abbreviation of university/group that created the obs.", example="WUR or UOB"),
    ]
)
#+end_src

#+RESULTS:


#+begin_src jupyter-python
games_cat.add_record_schema("verification_games_flux", games_data_schema)
#+end_src

#+RESULTS:

*** DONE Add games flux data by copying

#+begin_src jupyter-python
def get_path_and_metadata(record: CatalogRecord) -> tuple[str, dict, dict]:
    """Return path to record's data, user metadata dict, and derived metadata dict."""
    path = record.locator.value
    user_metadata = record.user_metadata.copy()
    derived_metadata = record.derived_metadata

    # fix the user metadata by removing unnecessary values
    user_metadata.pop("flux_product")
    user_metadata.pop("footprint_model")

    return path, user_metadata, derived_metadata
#+end_src

#+RESULTS:

To apply the derived metadata we need a hook. We'll just make a dictionary mapping the source paths to the metadata we want to add, then get return that metadata from an =extract_metadata= hook.

#+begin_src jupyter-python
from dataclasses import dataclass
from ogcat import OperationContext


derived_metadata_dict = {}

for record in flux_res:
    path, _, metadata = get_path_and_metadata(record)
    derived_metadata_dict[path] = metadata


@dataclass
class InjectDerivedMetadataHook:
    derived_metadata_dict: dict

    def extract_metadata(self, context: OperationContext) -> dict:
        return self.derived_metadata_dict.get(str(context.source_path))

#+end_src

#+RESULTS:

#+begin_src jupyter-python
pprint(next(iter(derived_metadata_dict.values())))
#+end_src

#+RESULTS:
#+begin_example
{'chunks': {'lat': 293, 'lon': 391, 'time': 24},
 'domain': 'EUROPE',
 'dtype': 'float32',
 'fallback_sources': {'FF': 'gridfed_total_o2',
                      'GPP': 'sib4_o2_gpp',
                      'TER': 'sib4_o2_ter',
                      'ocean': 'cesm_scaled_o2_ocean'},
 'input_record_ids': ['49', '36', '40', '41', '45'],
 'output_variables': ['GPP', 'TER', 'FF', 'ocean'],
 'reader_hint': 'xarray.open_dataset',
 'scenario': 'BASE',
 'sizes': {'lat': 293, 'lon': 391, 'time': 9048},
 'source_paths': {'FF': '/group/chem/acrg/verification_games_round_2/games_catalog/data/flux/derived/GridFED/v2024.0/o2_TOTAL_EUROPE_fossil-ff-monthly_2020-2021.nc',
                  'GPP': '/group/chem/acrg/verification_games_round_2/games_catalog/data/flux/derived/sib4/o2_GPP_EUROPE_biosphere-fallback-gpp_202012-202112.nc',
                  'TER': '/group/chem/acrg/verification_games_round_2/games_catalog/data/flux/derived/sib4/o2_TER_EUROPE_biosphere-fallback-ter_202012-202112.nc',
                  'ocean': '/group/chem/acrg/verification_games_round_2/games_catalog/data/flux/derived/cesm_scaled_o2/o2_ocean_EUROPE_cesm-apo-regridded_20201201-20211231.nc',
                  'primary_o2': '/group/chem/acrg/verification_games_round_2/verification-games-fluxes/data/raw/PARIS_BASE_O2.nc'},
 'units': 'mol m-2 s-1'}
#+end_example

Now let's make a fresh catalog with this hook (so we don't need to think about it later).


#+begin_src jupyter-python
from ogcat import PluginRegistry

_games_cat = Catalog.open(catalog_path, plugins=PluginRegistry([InjectDerivedMetadataHook(derived_metadata_dict)]))
#+end_src

#+RESULTS:


#+begin_src jupyter-python
COPY_TO_VERIFICATION_GAMES_FLUX = False

if COPY_TO_VERIFICATION_GAMES_FLUX:
    for record in flux_res:
        path, metadata, _ = get_path_and_metadata(record)
        metadata["title"] = "Fluxes for PARIS verification games 2026."
        _games_cat.add_file(path, metadata, operation="copy", record_type="verification_games_flux")
#+end_src

#+RESULTS:

#+begin_src jupyter-python
vg_flux_res = games_cat.search(where={"record_type": "verification_games_flux"})
pprint(vg_flux_res[0])
#+end_src

#+RESULTS:
#+begin_example
CatalogRecord(catalog='games-catalog',
              time_added='2026-05-09T14:27:08Z',
              id='89',
              record_type='verification_games_flux',
              locator=ArtifactLocator(kind='path',
                                      value='/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/PARIS_BASE_o2.nc',
                                      relative_path='data/verification_games_flux/UOB/PARIS_BASE_o2.nc'),
              stored_abspath='/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/PARIS_BASE_o2.nc',
              stored_relpath='data/verification_games_flux/UOB/PARIS_BASE_o2.nc',
              storage_mode='copy',
              original_path='/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_obs/UOB/CTE-HR_filled_o2_fluxes_none_EUROPE_BASE_o2_concentrations_202012-202112.nc',
              original_filename='CTE-HR_filled_o2_fluxes_none_EUROPE_BASE_o2_concentrations_202012-202112.nc',
              suffixes=['.nc'],
              user_metadata={'domain': 'EUROPE',
                             'games_scenario': 'BASE',
                             'inputs': ['49', '36', '40', '41', '45'],
                             'species': 'o2',
                             'title': 'Fluxes for PARIS verification games '
                                      '2026.',
                             'university_abbr': 'UOB',
                             'year': '202012-202112'},
              derived_metadata={'netcdf': {'attrs': {},
                                           'coords': ['lat', 'lon', 'time'],
                                           'data_vars': ['FF',
                                                         'GPP',
                                                         'TER',
                                                         'ocean'],
                                           'dims': {'lat': 293,
                                                    'lon': 391,
                                                    'time': 9048}}},
              naming_metadata={'directory_template': 'verification_games_flux/{university_abbr|}',
                               'filename_template': 'PARIS_{games_scenario}_{species}.nc',
                               'record_schema': 'verification_games_flux',
                               'resolved_directory': 'data/verification_games_flux/UOB',
                               'resolved_filename': 'PARIS_BASE_o2.nc',
                               'storage_relative_path': 'data/verification_games_flux/UOB/PARIS_BASE_o2.nc'})
#+end_example

The derived metadata hook didn't work (forgot to convert paths to strings), so I'll just add the derived metadata now.

#+begin_src jupyter-python
from dataclasses import replace as dc_replace

UPDATE_DERIVED_METADATA = False

if UPDATE_DERIVED_METADATA:
    for r in vg_flux_res:
        rid, species, scenario = r.id, r.user_metadata["species"], r.user_metadata["games_scenario"]
        res = games_cat.search(where={"record_type": "verification_games_obs", "species": species, "games_scenario": scenario})
        dmd = res[0].derived_metadata

        updated_r = dc_replace(r, derived_metadata=r.derived_metadata | dmd)
        games_cat.repository.update(updated_r)
#+end_src

#+RESULTS:

#+begin_src jupyter-python
vg_flux_res = games_cat.search(where={"record_type": "verification_games_flux"})
pprint(vg_flux_res[0])
#+end_src

#+RESULTS:
#+begin_example
CatalogRecord(catalog='games-catalog',
              time_added='2026-05-09T14:27:08Z',
              id='89',
              record_type='verification_games_flux',
              locator=ArtifactLocator(kind='path',
                                      value='/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/PARIS_BASE_o2.nc',
                                      relative_path='data/verification_games_flux/UOB/PARIS_BASE_o2.nc'),
              stored_abspath='/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/PARIS_BASE_o2.nc',
              stored_relpath='data/verification_games_flux/UOB/PARIS_BASE_o2.nc',
              storage_mode='copy',
              original_path='/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_obs/UOB/CTE-HR_filled_o2_fluxes_none_EUROPE_BASE_o2_concentrations_202012-202112.nc',
              original_filename='CTE-HR_filled_o2_fluxes_none_EUROPE_BASE_o2_concentrations_202012-202112.nc',
              suffixes=['.nc'],
              user_metadata={'domain': 'EUROPE',
                             'games_scenario': 'BASE',
                             'inputs': ['49', '36', '40', '41', '45'],
                             'species': 'o2',
                             'title': 'Fluxes for PARIS verification games '
                                      '2026.',
                             'university_abbr': 'UOB',
                             'year': '202012-202112'},
              derived_metadata={'chunks': {'lat': 293, 'lon': 391, 'time': 24},
                                'domain': 'EUROPE',
                                'dtype': 'float32',
                                'fallback_sources': {'FF': 'gridfed_total_o2',
                                                     'GPP': 'sib4_o2_gpp',
                                                     'TER': 'sib4_o2_ter',
                                                     'ocean': 'cesm_scaled_o2_ocean'},
                                'input_record_ids': ['49',
                                                     '36',
                                                     '40',
                                                     '41',
                                                     '45'],
                                'netcdf': {'attrs': {},
                                           'coords': ['lat', 'lon', 'time'],
                                           'data_vars': ['FF',
                                                         'GPP',
                                                         'TER',
                                                         'ocean'],
                                           'dims': {'lat': 293,
                                                    'lon': 391,
                                                    'time': 9048}},
                                'output_variables': ['GPP',
                                                     'TER',
                                                     'FF',
                                                     'ocean'],
                                'reader_hint': 'xarray.open_dataset',
                                'scenario': 'BASE',
                                'sizes': {'lat': 293, 'lon': 391, 'time': 9048},
                                'source_paths': {'FF': '/group/chem/acrg/verification_games_round_2/games_catalog/data/flux/derived/GridFED/v2024.0/o2_TOTAL_EUROPE_fossil-ff-monthly_2020-2021.nc',
                                                 'GPP': '/group/chem/acrg/verification_games_round_2/games_catalog/data/flux/derived/sib4/o2_GPP_EUROPE_biosphere-fallback-gpp_202012-202112.nc',
                                                 'TER': '/group/chem/acrg/verification_games_round_2/games_catalog/data/flux/derived/sib4/o2_TER_EUROPE_biosphere-fallback-ter_202012-202112.nc',
                                                 'ocean': '/group/chem/acrg/verification_games_round_2/games_catalog/data/flux/derived/cesm_scaled_o2/o2_ocean_EUROPE_cesm-apo-regridded_20201201-20211231.nc',
                                                 'primary_o2': '/group/chem/acrg/verification_games_round_2/verification-games-fluxes/data/raw/PARIS_BASE_O2.nc'},
                                'units': 'mol m-2 s-1'},
              naming_metadata={'directory_template': 'verification_games_flux/{university_abbr|}',
                               'filename_template': 'PARIS_{games_scenario}_{species}.nc',
                               'record_schema': 'verification_games_flux',
                               'resolved_directory': 'data/verification_games_flux/UOB',
                               'resolved_filename': 'PARIS_BASE_o2.nc',
                               'storage_relative_path': 'data/verification_games_flux/UOB/PARIS_BASE_o2.nc'})
#+end_example


** WAIT Delete incorrect entries

I used the wrong record type when I stored the PARIS_.. fluxes. I've copied them to new records with the correct metadata and record schema, and want to delete the incorrect data.

Wait until you're sure the flux data is correct.

#+begin_src jupyter-python
!ls -lh {Path(vg_flux_res[0].locator.value).parent}
#+end_src

#+RESULTS:
#+begin_example
total 52G
-rw-rw-r-- 1 bm13805 acrg 5.5G May  8 09:57 PARIS_ATEN_co2.nc
-rw-rw-r-- 1 bm13805 acrg 6.1G May  7 21:39 PARIS_ATEN_o2.nc
-rw-rw-r-- 1 bm13805 acrg 5.5G May  8 10:02 PARIS_BASE_co2.nc
-rw-rw-r-- 1 bm13805 acrg 8.6G May  7 21:12 PARIS_BASE_o2.nc
-rw-rw-r-- 1 bm13805 acrg 5.5G May  8 10:07 PARIS_DFIN_co2.nc
-rw-rw-r-- 1 bm13805 acrg 1.1G May  7 23:07 PARIS_DFIN_o2.nc
-rw-rw-r-- 1 bm13805 acrg 5.5G May  8 10:12 PARIS_HFRA_co2.nc
-rw-rw-r-- 1 bm13805 acrg 1.1G May  7 23:10 PARIS_HFRA_o2.nc
-rw-rw-r-- 1 bm13805 acrg 5.5G May  8 10:17 PARIS_HGER_co2.nc
-rw-rw-r-- 1 bm13805 acrg 1.1G May  7 23:13 PARIS_HGER_o2.nc
-rw-rw-r-- 1 bm13805 acrg 5.5G May  8 10:21 PARIS_PTEN_co2.nc
-rw-rw-r-- 1 bm13805 acrg 1.1G May  7 23:16 PARIS_PTEN_o2.nc
#+end_example

Okay looks like the data has been copied successfully, but there isn't a delete method for =Catalog=, so maybe we'll just leave it for now.

** DONE Verify that fluxes are correct

Some of the fluxes seem too small (all the CO2 fluxes have the same size, but the O2 fluxes have widely varying sizes).


#+begin_src jupyter-python
!ls -lhst {Path(vg_flux_res[0].locator.value).parent} | grep "_o2"
#+end_src

#+RESULTS:
: 1.1G -rw-rw-r-- 1 bm13805 acrg 1.1G May  7 23:16 PARIS_PTEN_o2.nc
: 1.1G -rw-rw-r-- 1 bm13805 acrg 1.1G May  7 23:13 PARIS_HGER_o2.nc
: 1.1G -rw-rw-r-- 1 bm13805 acrg 1.1G May  7 23:10 PARIS_HFRA_o2.nc
: 1.1G -rw-rw-r-- 1 bm13805 acrg 1.1G May  7 23:07 PARIS_DFIN_o2.nc
: 6.1G -rw-rw-r-- 1 bm13805 acrg 6.1G May  7 21:39 PARIS_ATEN_o2.nc
: 8.6G -rw-rw-r-- 1 bm13805 acrg 8.6G May  7 21:12 PARIS_BASE_o2.nc

#+begin_src jupyter-python
games_flux_dir = Path(vg_flux_res[0].locator.value).parent
#+end_src

#+RESULTS:

#+begin_src jupyter-python
%%bash -s $games_flux_dir
files=$(ls -lst $1 | grep "_o2" | awk '{ print $10}')

for x in $files; do file "$1"/"$x"; echo; done;
#+end_src

#+RESULTS:
:RESULTS:
#+begin_example
/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/PARIS_PTEN_o2.nc: Hierarchical Data Format (version 5) data

/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/PARIS_HGER_o2.nc: Hierarchical Data Format (version 5) data

/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/PARIS_HFRA_o2.nc: Hierarchical Data Format (version 5) data

/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/PARIS_DFIN_o2.nc: Hierarchical Data Format (version 5) data

/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/PARIS_ATEN_o2.nc: Hierarchical Data Format (version 5) data

/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/PARIS_BASE_o2.nc: Hierarchical Data Format (version 5) data

#+end_example
:END:


*** Summary of ncdump

#+begin_src jupyter-python
%%bash
module load openmpi netcdf-c hdf5 2>/dev/null

dir=/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB

for f in "$dir"/PARIS_*_o2.nc; do
  echo
  echo "### $(basename "$f")"
  ls -lh "$f"

  ncdump -hs "$f" | grep -E \
    ':(GPP|TER|FF|ocean):?_|(GPP|TER|FF|ocean):_(Storage|ChunkSizes|DeflateLevel|Shuffle|Fletcher32|Endianness|NoFill|FillValue)'
done

#+end_src

#+RESULTS:
:RESULTS:
#+begin_example

### PARIS_ATEN_o2.nc-rw-rw-r-- 1 bm13805 acrg 6.1G May  7 21:39 /group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/PARIS_ATEN_o2.nc
		GPP:_FillValue = NaNf ;
		GPP:_Storage = "chunked" ;
		GPP:_ChunkSizes = 24, 293, 391 ;
		GPP:_Shuffle = "true" ;
		GPP:_DeflateLevel = 4 ;
		GPP:_Endianness = "little" ;
		TER:_FillValue = NaNf ;	TER:_Storage = "chunked" ;
		TER:_ChunkSizes = 24, 293, 391 ;
		TER:_Shuffle = "true" ;
		TER:_DeflateLevel = 4 ;
		TER:_Endianness = "little" ;
		FF:_FillValue = NaNf ;
		FF:_Storage = "chunked" ;	FF:_ChunkSizes = 24, 293, 391 ;
		FF:_Shuffle = "true" ;
		FF:_DeflateLevel = 4 ;
		FF:_Endianness = "little" ;
		ocean:_FillValue = NaNf ;
		ocean:_Storage = "chunked" ;
		ocean:_ChunkSizes = 24, 293, 391 ;
		ocean:_Shuffle = "true" ;
		ocean:_DeflateLevel = 4 ;
		ocean:_Endianness = "little" ;

### PARIS_BASE_o2.nc
-rw-rw-r-- 1 bm13805 acrg 8.6G May  7 21:12 /group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/PARIS_BASE_o2.nc
		GPP:_FillValue = NaNf ;
		GPP:_Storage = "chunked" ;
		GPP:_ChunkSizes = 24, 293, 391 ;
		GPP:_Shuffle = "true" ;
		GPP:_DeflateLevel = 4 ;
		GPP:_Endianness = "little" ;
		TER:_FillValue = NaNf ;	TER:_Storage = "chunked" ;
		TER:_ChunkSizes = 24, 293, 391 ;
		TER:_Shuffle = "true" ;
		TER:_DeflateLevel = 4 ;
		TER:_Endianness = "little" ;
		FF:_FillValue = NaNf ;
		FF:_Storage = "chunked" ;	FF:_ChunkSizes = 24, 293, 391 ;
		FF:_Shuffle = "true" ;
		FF:_DeflateLevel = 4 ;
		FF:_Endianness = "little" ;
		ocean:_FillValue = NaNf ;
		ocean:_Storage = "chunked" ;
		ocean:_ChunkSizes = 24, 293, 391 ;
		ocean:_Shuffle = "true" ;
		ocean:_DeflateLevel = 4 ;
		ocean:_Endianness = "little" ;

### PARIS_DFIN_o2.nc
-rw-rw-r-- 1 bm13805 acrg 1.1G May  7 23:07 /group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/PARIS_DFIN_o2.nc
		GPP:_FillValue = NaNf ;
		GPP:_Storage = "chunked" ;
		GPP:_ChunkSizes = 1293, 42, 56 ;
		GPP:_Shuffle = "true" ;
		GPP:_DeflateLevel = 4 ;
		GPP:_Endianness = "little" ;
		GPP:_NoFill = "true" ;TER:_FillValue = NaNf ;
		TER:_Storage = "chunked" ;
		TER:_ChunkSizes = 1293, 42, 56 ;
		TER:_Shuffle = "true" ;
		TER:_DeflateLevel = 4 ;
		TER:_Endianness = "little" ;
		TER:_NoFill = "true" ;
		FF:_FillValue = NaNf ;
		FF:_Storage = "chunked" ;
		FF:_ChunkSizes = 1293, 42, 56 ;
		FF:_Shuffle = "true" ;
		FF:_DeflateLevel = 4 ;
		FF:_Endianness = "little" ;
		FF:_NoFill = "true" ;
		ocean:_FillValue = NaNf ;
		ocean:_Storage = "chunked" ;
		ocean:_ChunkSizes = 1293, 42, 56 ;
		ocean:_Shuffle = "true" ;
		ocean:_DeflateLevel = 4 ;
		ocean:_Endianness = "little" ;
		ocean:_NoFill = "true" ;

### PARIS_HFRA_o2.nc
-rw-rw-r-- 1 bm13805 acrg 1.1G May  7 23:10 /group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/PARIS_HFRA_o2.nc
		GPP:_FillValue = NaNf ;
		GPP:_Storage = "chunked" ;
		GPP:_ChunkSizes = 1293, 42, 56 ;
		GPP:_Shuffle = "true" ;
		GPP:_DeflateLevel = 4 ;
		GPP:_Endianness = "little" ;
		GPP:_NoFill = "true" ;TER:_FillValue = NaNf ;
		TER:_Storage = "chunked" ;
		TER:_ChunkSizes = 1293, 42, 56 ;
		TER:_Shuffle = "true" ;
		TER:_DeflateLevel = 4 ;
		TER:_Endianness = "little" ;
		TER:_NoFill = "true" ;
		FF:_FillValue = NaNf ;
		FF:_Storage = "chunked" ;
		FF:_ChunkSizes = 1293, 42, 56 ;
		FF:_Shuffle = "true" ;
		FF:_DeflateLevel = 4 ;
		FF:_Endianness = "little" ;
		FF:_NoFill = "true" ;
		ocean:_FillValue = NaNf ;
		ocean:_Storage = "chunked" ;
		ocean:_ChunkSizes = 1293, 42, 56 ;
		ocean:_Shuffle = "true" ;
		ocean:_DeflateLevel = 4 ;
		ocean:_Endianness = "little" ;
		ocean:_NoFill = "true" ;

### PARIS_HGER_o2.nc
-rw-rw-r-- 1 bm13805 acrg 1.1G May  7 23:13 /group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/PARIS_HGER_o2.nc
		GPP:_FillValue = NaNf ;
		GPP:_Storage = "chunked" ;
		GPP:_ChunkSizes = 1293, 42, 56 ;
		GPP:_Shuffle = "true" ;
		GPP:_DeflateLevel = 4 ;
		GPP:_Endianness = "little" ;
		GPP:_NoFill = "true" ;TER:_FillValue = NaNf ;
		TER:_Storage = "chunked" ;
		TER:_ChunkSizes = 1293, 42, 56 ;
		TER:_Shuffle = "true" ;
		TER:_DeflateLevel = 4 ;
		TER:_Endianness = "little" ;
		TER:_NoFill = "true" ;
		FF:_FillValue = NaNf ;
		FF:_Storage = "chunked" ;
		FF:_ChunkSizes = 1293, 42, 56 ;
		FF:_Shuffle = "true" ;
		FF:_DeflateLevel = 4 ;
		FF:_Endianness = "little" ;
		FF:_NoFill = "true" ;
		ocean:_FillValue = NaNf ;
		ocean:_Storage = "chunked" ;
		ocean:_ChunkSizes = 1293, 42, 56 ;
		ocean:_Shuffle = "true" ;
		ocean:_DeflateLevel = 4 ;
		ocean:_Endianness = "little" ;
		ocean:_NoFill = "true" ;

### PARIS_PTEN_o2.nc
-rw-rw-r-- 1 bm13805 acrg 1.1G May  7 23:16 /group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/PARIS_PTEN_o2.nc
		GPP:_FillValue = NaNf ;
		GPP:_Storage = "chunked" ;
		GPP:_ChunkSizes = 1293, 42, 56 ;
		GPP:_Shuffle = "true" ;
		GPP:_DeflateLevel = 4 ;
		GPP:_Endianness = "little" ;
		GPP:_NoFill = "true" ;TER:_FillValue = NaNf ;
		TER:_Storage = "chunked" ;
		TER:_ChunkSizes = 1293, 42, 56 ;
		TER:_Shuffle = "true" ;
		TER:_DeflateLevel = 4 ;
		TER:_Endianness = "little" ;
		TER:_NoFill = "true" ;
		FF:_FillValue = NaNf ;
		FF:_Storage = "chunked" ;
		FF:_ChunkSizes = 1293, 42, 56 ;
		FF:_Shuffle = "true" ;
		FF:_DeflateLevel = 4 ;
		FF:_Endianness = "little" ;
		FF:_NoFill = "true" ;
		ocean:_FillValue = NaNf ;
		ocean:_Storage = "chunked" ;
		ocean:_ChunkSizes = 1293, 42, 56 ;
		ocean:_Shuffle = "true" ;
		ocean:_DeflateLevel = 4 ;
		ocean:_Endianness = "little" ;
		ocean:_NoFill = "true" ;
#+end_example
:END:

It looks like the compression levels are the same.

*** h5py summary

#+begin_src jupyter-python
from pathlib import Path
import h5py
import pandas as pd

flux_dir = Path("/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB")
rows = []

for path in sorted(flux_dir.glob("PARIS_*_o2.nc")):
    with h5py.File(path, "r") as h5:
        for var in ["GPP", "TER", "FF", "ocean"]:
            if var not in h5:
                rows.append({"file": path.name, "var": var, "missing_var": True})
                continue

            d = h5[var]
            rows.append({
                "file": path.name,
                "var": var,
                "shape": d.shape,
                "dtype": str(d.dtype),
                "chunks": d.chunks,
                "compression": d.compression,
                "compression_opts": d.compression_opts,
                "shuffle": d.shuffle,
                "fletcher32": d.fletcher32,
                "size_GB": path.stat().st_size / 1024**3,
            })

o2_df = pd.DataFrame(rows)

print(o2_df)
#+end_src

#+RESULTS:
#+begin_example
                file    var             shape  ... shuffle fletcher32   size_GB
0   PARIS_ATEN_o2.nc    GPP  (9048, 293, 391)  ...    True      False  6.041482
1   PARIS_ATEN_o2.nc    TER  (9048, 293, 391)  ...    True      False  6.041482
2   PARIS_ATEN_o2.nc     FF  (9048, 293, 391)  ...    True      False  6.041482
3   PARIS_ATEN_o2.nc  ocean  (9048, 293, 391)  ...    True      False  6.041482
4   PARIS_BASE_o2.nc    GPP  (9048, 293, 391)  ...    True      False  8.503042
5   PARIS_BASE_o2.nc    TER  (9048, 293, 391)  ...    True      False  8.503042
6   PARIS_BASE_o2.nc     FF  (9048, 293, 391)  ...    True      False  8.503042
7   PARIS_BASE_o2.nc  ocean  (9048, 293, 391)  ...    True      False  8.503042
8   PARIS_DFIN_o2.nc    GPP  (9048, 293, 391)  ...    True      False  1.083139
9   PARIS_DFIN_o2.nc    TER  (9048, 293, 391)  ...    True      False  1.083139
10  PARIS_DFIN_o2.nc     FF  (9048, 293, 391)  ...    True      False  1.083139
11  PARIS_DFIN_o2.nc  ocean  (9048, 293, 391)  ...    True      False  1.083139
12  PARIS_HFRA_o2.nc    GPP  (9048, 293, 391)  ...    True      False  1.083161
13  PARIS_HFRA_o2.nc    TER  (9048, 293, 391)  ...    True      False  1.083161
14  PARIS_HFRA_o2.nc     FF  (9048, 293, 391)  ...    True      False  1.083161
15  PARIS_HFRA_o2.nc  ocean  (9048, 293, 391)  ...    True      False  1.083161
16  PARIS_HGER_o2.nc    GPP  (9048, 293, 391)  ...    True      False  1.083109
17  PARIS_HGER_o2.nc    TER  (9048, 293, 391)  ...    True      False  1.083109
18  PARIS_HGER_o2.nc     FF  (9048, 293, 391)  ...    True      False  1.083109
19  PARIS_HGER_o2.nc  ocean  (9048, 293, 391)  ...    True      False  1.083109
20  PARIS_PTEN_o2.nc    GPP  (9048, 293, 391)  ...    True      False  1.083411
21  PARIS_PTEN_o2.nc    TER  (9048, 293, 391)  ...    True      False  1.083411
22  PARIS_PTEN_o2.nc     FF  (9048, 293, 391)  ...    True      False  1.083411
23  PARIS_PTEN_o2.nc  ocean  (9048, 293, 391)  ...    True      False  1.083411

[24 rows x 10 columns]
#+end_example

#+begin_src jupyter-python
print(o2_df.columns)
#+end_src

#+RESULTS:
: Index(['file', 'var', 'shape', 'dtype', 'chunks', 'compression',
:        'compression_opts', 'shuffle', 'fletcher32', 'size_GB'],
:       dtype='object')


#+begin_src jupyter-python
for col in o2_df.columns:
    print(col, o2_df[col].unique())
#+end_src

#+RESULTS:
#+begin_example
file ['PARIS_ATEN_o2.nc' 'PARIS_BASE_o2.nc' 'PARIS_DFIN_o2.nc'
 'PARIS_HFRA_o2.nc' 'PARIS_HGER_o2.nc' 'PARIS_PTEN_o2.nc']
var ['GPP' 'TER' 'FF' 'ocean']
shape [(9048, 293, 391)]
dtype ['float32']
chunks [(24, 293, 391) (1293, 42, 56)]
compression ['gzip']
compression_opts [4]
shuffle [ True]
fletcher32 [False]
size_GB [6.04148236 8.50304239 1.08313855 1.08316125 1.08310883 1.0834106 ]
#+end_example

Okay so only the chunk sizes seem to vary...

#+begin_src jupyter-python
print(o2_df[["file", "var", "chunks", "size_GB"]])
#+end_src

#+RESULTS:
#+begin_example
                file    var          chunks   size_GB
0   PARIS_ATEN_o2.nc    GPP  (24, 293, 391)  6.041482
1   PARIS_ATEN_o2.nc    TER  (24, 293, 391)  6.041482
2   PARIS_ATEN_o2.nc     FF  (24, 293, 391)  6.041482
3   PARIS_ATEN_o2.nc  ocean  (24, 293, 391)  6.041482
4   PARIS_BASE_o2.nc    GPP  (24, 293, 391)  8.503042
5   PARIS_BASE_o2.nc    TER  (24, 293, 391)  8.503042
6   PARIS_BASE_o2.nc     FF  (24, 293, 391)  8.503042
7   PARIS_BASE_o2.nc  ocean  (24, 293, 391)  8.503042
8   PARIS_DFIN_o2.nc    GPP  (1293, 42, 56)  1.083139
9   PARIS_DFIN_o2.nc    TER  (1293, 42, 56)  1.083139
10  PARIS_DFIN_o2.nc     FF  (1293, 42, 56)  1.083139
11  PARIS_DFIN_o2.nc  ocean  (1293, 42, 56)  1.083139
12  PARIS_HFRA_o2.nc    GPP  (1293, 42, 56)  1.083161
13  PARIS_HFRA_o2.nc    TER  (1293, 42, 56)  1.083161
14  PARIS_HFRA_o2.nc     FF  (1293, 42, 56)  1.083161
15  PARIS_HFRA_o2.nc  ocean  (1293, 42, 56)  1.083161
16  PARIS_HGER_o2.nc    GPP  (1293, 42, 56)  1.083109
17  PARIS_HGER_o2.nc    TER  (1293, 42, 56)  1.083109
18  PARIS_HGER_o2.nc     FF  (1293, 42, 56)  1.083109
19  PARIS_HGER_o2.nc  ocean  (1293, 42, 56)  1.083109
20  PARIS_PTEN_o2.nc    GPP  (1293, 42, 56)  1.083411
21  PARIS_PTEN_o2.nc    TER  (1293, 42, 56)  1.083411
22  PARIS_PTEN_o2.nc     FF  (1293, 42, 56)  1.083411
23  PARIS_PTEN_o2.nc  ocean  (1293, 42, 56)  1.083411
#+end_example

Okay, maybe that explains it: the larger time chunks with smaller lat/lon chunks gave better compression.

*** Missing data checks

#+begin_src jupyter-python
import xarray as xr
import pandas as pd

o2_flux_vars = ["GPP", "TER", "FF", "ocean"]
missing_data_frames = []

for path in sorted(flux_dir.glob("PARIS_*_o2.nc")):
    print(f"Processing {path.name}", flush=True)
    ds = xr.open_dataset(path, chunks={})
    try:
        sub = ds[o2_flux_vars]
        reduce_dims = tuple(sub.sizes)

        # Build all scalar reductions first, then submit one Dask graph per file.
        stats = xr.Dataset(
            {
                "nan_count": sub.isnull().sum(dim=reduce_dims).to_array("var"),
                "finite_count": sub.notnull().sum(dim=reduce_dims).to_array("var"),
                "min": sub.min(dim=reduce_dims, skipna=True).to_array("var"),
                "max": sub.max(dim=reduce_dims, skipna=True).to_array("var"),
                "mean": sub.mean(dim=reduce_dims, skipna=True).to_array("var"),
            }
        ).compute()

        df = stats.to_dataframe().reset_index()
        df.insert(0, "file", path.name)
        df["shape"] = [tuple(ds[var].shape) for var in df["var"]]
        df["time"] = [ds[var].sizes.get("time") for var in df["var"]]
        missing_data_frames.append(df)
    finally:
        ds.close()

missing_data_df = pd.concat(missing_data_frames, ignore_index=True)
print(missing_data_df)
#+end_src

#+RESULTS:
#+begin_example
Processing PARIS_ATEN_o2.nc
Processing PARIS_BASE_o2.nc
Processing PARIS_DFIN_o2.nc
Processing PARIS_HFRA_o2.nc
Processing PARIS_HGER_o2.nc
Processing PARIS_PTEN_o2.nc
                file    var  nan_count  ...          mean             shape  time
0   PARIS_ATEN_o2.nc    GPP  494907504  ...  1.152476e-06  (9048, 293, 391)  9048
1   PARIS_ATEN_o2.nc    TER  494907504  ... -1.148101e-06  (9048, 293, 391)  9048
2   PARIS_ATEN_o2.nc     FF          0  ... -1.489023e-07  (9048, 293, 391)  9048
3   PARIS_ATEN_o2.nc  ocean          0  ... -1.344262e-07  (9048, 293, 391)  9048
4   PARIS_BASE_o2.nc    GPP  494907504  ...  1.152476e-06  (9048, 293, 391)  9048
5   PARIS_BASE_o2.nc    TER  494907504  ... -1.148101e-06  (9048, 293, 391)  9048
6   PARIS_BASE_o2.nc     FF          0  ... -1.419013e-07  (9048, 293, 391)  9048
7   PARIS_BASE_o2.nc  ocean          0  ... -1.344262e-07  (9048, 293, 391)  9048
8   PARIS_DFIN_o2.nc    GPP  494907504  ...  1.156446e-06  (9048, 293, 391)  9048
9   PARIS_DFIN_o2.nc    TER  494907504  ... -1.148101e-06  (9048, 293, 391)  9048
10  PARIS_DFIN_o2.nc     FF          0  ... -1.419013e-07  (9048, 293, 391)  9048
11  PARIS_DFIN_o2.nc  ocean          0  ... -1.344262e-07  (9048, 293, 391)  9048
12  PARIS_HFRA_o2.nc    GPP  494907504  ...  1.152476e-06  (9048, 293, 391)  9048
13  PARIS_HFRA_o2.nc    TER  494907504  ... -1.148101e-06  (9048, 293, 391)  9048
14  PARIS_HFRA_o2.nc     FF          0  ... -1.415793e-07  (9048, 293, 391)  9048
15  PARIS_HFRA_o2.nc  ocean          0  ... -1.344262e-07  (9048, 293, 391)  9048
16  PARIS_HGER_o2.nc    GPP  494907504  ...  1.152476e-06  (9048, 293, 391)  9048
17  PARIS_HGER_o2.nc    TER  494907504  ... -1.148101e-06  (9048, 293, 391)  9048
18  PARIS_HGER_o2.nc     FF          0  ... -1.408846e-07  (9048, 293, 391)  9048
19  PARIS_HGER_o2.nc  ocean          0  ... -1.344262e-07  (9048, 293, 391)  9048
20  PARIS_PTEN_o2.nc    GPP  494907504  ...  1.152476e-06  (9048, 293, 391)  9048
21  PARIS_PTEN_o2.nc    TER  494907504  ... -1.148101e-06  (9048, 293, 391)  9048
22  PARIS_PTEN_o2.nc     FF          0  ... -1.185381e-07  (9048, 293, 391)  9048
23  PARIS_PTEN_o2.nc  ocean          0  ... -1.344262e-07  (9048, 293, 391)  9048

[24 rows x 9 columns]
#+end_example

#+begin_src jupyter-python
print(missing_data_df.columns)
#+end_src

#+RESULTS:
: Index(['file', 'var', 'nan_count', 'finite_count', 'min', 'max', 'mean',
:        'shape', 'time'],
:       dtype='object')

Let's figure out what varies so we can drop uninformative columns.
#+begin_src jupyter-python
for col in missing_data_df.columns:
    print(col, missing_data_df[col].unique())
#+end_src

#+RESULTS:
#+begin_example
file ['PARIS_ATEN_o2.nc' 'PARIS_BASE_o2.nc' 'PARIS_DFIN_o2.nc'
 'PARIS_HFRA_o2.nc' 'PARIS_HGER_o2.nc' 'PARIS_PTEN_o2.nc']
var ['GPP' 'TER' 'FF' 'ocean']
nan_count [494907504         0]
finite_count [ 541658520 1036566024]
min [ 0.0000000e+00 -2.1310241e-05 -3.6742419e-04 -5.6239405e-06]
max [5.3446129e-05 0.0000000e+00 2.1913859e-06]
mean [ 1.1524758e-06 -1.1481011e-06 -1.4890232e-07 -1.3442616e-07
 -1.4190130e-07  1.1564457e-06 -1.1481009e-06 -1.3442617e-07
  1.1524756e-06 -1.4157931e-07 -1.4088461e-07 -1.1853813e-07]
shape [(9048, 293, 391)]
time [9048]
#+end_example

Okay we'll ignore shape and time, and I'll shorten the file names to "scenarios".

#+begin_src jupyter-python
missing_data_df["scenario"] = missing_data_df["file"].str.removeprefix("PARIS_").str.removesuffix("_o2.nc")
md_df = missing_data_df[["var", "scenario", "nan_count", "finite_count", "min", "max", "mean"]].set_index(["var", "scenario"])
print(md_df.sort_index())
#+end_src

#+RESULTS:
#+begin_example
                nan_count  finite_count       min       max          mean
var   scenario
FF    ATEN              0    1036566024 -0.000367  0.000000 -1.489023e-07
      BASE              0    1036566024 -0.000367  0.000000 -1.419013e-07
      DFIN              0    1036566024 -0.000367  0.000000 -1.419013e-07
      HFRA              0    1036566024 -0.000367  0.000000 -1.415793e-07
      HGER              0    1036566024 -0.000367  0.000000 -1.408846e-07
      PTEN              0    1036566024 -0.000367  0.000000 -1.185381e-07
GPP   ATEN      494907504     541658520  0.000000  0.000053  1.152476e-06
      BASE      494907504     541658520  0.000000  0.000053  1.152476e-06
      DFIN      494907504     541658520  0.000000  0.000053  1.156446e-06
      HFRA      494907504     541658520  0.000000  0.000053  1.152476e-06
      HGER      494907504     541658520  0.000000  0.000053  1.152476e-06
      PTEN      494907504     541658520  0.000000  0.000053  1.152476e-06
TER   ATEN      494907504     541658520 -0.000021  0.000000 -1.148101e-06
      BASE      494907504     541658520 -0.000021  0.000000 -1.148101e-06
      DFIN      494907504     541658520 -0.000021  0.000000 -1.148101e-06
      HFRA      494907504     541658520 -0.000021  0.000000 -1.148101e-06
      HGER      494907504     541658520 -0.000021  0.000000 -1.148101e-06
      PTEN      494907504     541658520 -0.000021  0.000000 -1.148101e-06
ocean ATEN              0    1036566024 -0.000006  0.000002 -1.344262e-07
      BASE              0    1036566024 -0.000006  0.000002 -1.344262e-07
      DFIN              0    1036566024 -0.000006  0.000002 -1.344262e-07
      HFRA              0    1036566024 -0.000006  0.000002 -1.344262e-07
      HGER              0    1036566024 -0.000006  0.000002 -1.344262e-07
      PTEN              0    1036566024 -0.000006  0.000002 -1.344262e-07
#+end_example

Observations:
- GPP and TER have NaNs, but the same number for each scenario
- FF and ocean have no NaNs
- For all scenarios, the sum of =nan_count= and =finite_count= seems to be the same: 494907504 + 541658520 = 1036566024
- Within each scenario, all the columns are constant, except for the mean for different FF (fossil fuel) scenarios. Each scenario is a perturbation of "BASE", so I would expect some differences.
- GPP (i.e. photosynthesis) is positive and TER (i.e. respiration) is negative
- The non-zero mins or maxs, and the means seem to have roughly the right order of magnitude.


*** Conclusion: the size difference is probably due to chunk sizes

There is a ~6-8x difference in the size of the files based on the chunks, but that is not necessarily surprising:

For ATEN/BASE, chunks are (24, 293, 391): each compressed chunk is a full spatial map over 24 times. That mixes land, ocean, ice, coastline, point sources, NaNs, zeros, and nonzero fluxes into every chunk.

For DFIN/HFRA/HGER/PTEN, chunks are (1293, 42, 56): each chunk is a smaller spatial tile over a much longer time period. That can compress much better because many tiles may be mostly ocean, mostly land, mostly NaN, mostly zero, or smoothly varying through time. Gzip+shuffle works per HDF5 chunk, and it cannot use redundancy across chunk boundaries, so chunk shape matters a lot.
